# *Merged Jupyter Notebook*

<hr><font color="green"><h1>from file: 01-Introduction to Pandas</h1></font>

# Introduction to Pandas

In this section of the course we will learn how to use pandas for data analysis. You can think of pandas as an extremely powerful version of Excel, with a lot more features. In this section of the course, you should go through the notebooks in this order:

* Introduction to Pandas
* Series
* DataFrames
* Missing Data
* GroupBy
* Merging,Joining,and Concatenating
* Operations
* Data Input and Output

___

<hr><font color="green"><h1>from file: 02-Series</h1></font>

# Series

The first main data type we will learn about for pandas is the Series data type. Let's import Pandas and explore the Series object.

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

Let's explore this concept through some examples:

In [1]:
import numpy as np
import pandas as pd

### Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

** Using Lists**

In [3]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(labels,my_list)

10    a
20    b
30    c
dtype: object

** NumPy Arrays **

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

** Dictionary**

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Data in a Series

A pandas Series can hold a variety of object types:

In [10]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [11]:
# Even functions (although unlikely that you will use this)
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

## Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [12]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [13]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [14]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [15]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [16]:
ser1['USA']

1

Operations are then also done based off of index:

In [17]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

Let's stop here for now and move on to DataFrames, which will expand on the concept of Series!
# Great Job!

<hr><font color="green"><h1>from file: 03-DataFrames</h1></font>

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [2]:
import pandas as pd
import numpy as np

In [3]:
from numpy.random import randn

In [4]:
df = pd.DataFrame(randn(5,4),index=['A','B','C','D','E'],columns='W X Y Z'.split())

In [5]:
df

          W         X         Y         Z
A  1.474513 -0.300132  1.780505  1.010527
B  1.379491  0.884730  0.365551 -0.077145
C -0.858961 -0.710047  0.093110 -0.438866
D  0.022216  0.155334  1.852503  2.558013
E  0.806120 -0.659891  0.458686 -0.179250

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [16]:
df.iloc[1]

W    1.379491
X    0.884730
Y    0.365551
Z   -0.077145
Name: B, dtype: float64

In [11]:
# Pass a list of column names
type(df[['W','X','Z']])

pandas.core.frame.DataFrame

In [10]:
# SQL Syntax (NOT RECOMMENDED!)

A    1.474513
B    1.379491
C   -0.858961
D    0.022216
E    0.806120
Name: W, dtype: float64

DataFrame Columns are just Series

In [190]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [18]:
df['total_sales'] = df['unit_price']*df['units_sold']

In [17]:
df['new_column'] = df['W']+df['Z']

In [18]:
df

          W         X         Y         Z  new_column
A  1.474513 -0.300132  1.780505  1.010527    2.485040
B  1.379491  0.884730  0.365551 -0.077145    1.302345
C -0.858961 -0.710047  0.093110 -0.438866   -1.297827
D  0.022216  0.155334  1.852503  2.558013    2.580230
E  0.806120 -0.659891  0.458686 -0.179250    0.626870

** Removing Columns**

In [21]:
df.drop('new_column', axis=1, inplace=True)

In [22]:
# Not inplace unless specified!
df

          W         X         Y         Z
A  1.474513 -0.300132  1.780505  1.010527
B  1.379491  0.884730  0.365551 -0.077145
C -0.858961 -0.710047  0.093110 -0.438866
D  0.022216  0.155334  1.852503  2.558013
E  0.806120 -0.659891  0.458686 -0.179250

In [37]:
df.drop('new',axis=1,inplace=True)

KeyError: "['new'] not found in axis"

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Can also drop rows this way:

In [40]:
df.drop('E',inplace=True)

In [41]:
df['W'] = df['X']+df['Y']

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

** Selecting Rows**

In [17]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [18]:
df.loc['C']

W    2.154846
X   -0.610259
Y   -0.755325
Z   -0.346419
Name: C, dtype: float64

Or select based off of position instead of label

In [19]:
df.iloc[2]

W    2.154846
X   -0.610259
Y   -0.755325
Z   -0.346419
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [21]:
df.loc['C','X']

-0.6102588558227414

In [24]:
df.loc[['A','C'],['W','Y']]

          W         Y
A -0.993263 -1.136645
C  2.154846 -0.755325

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [23]:
df

          W         X         Y         Z
A  1.474513 -0.300132  1.780505  1.010527
B  1.379491  0.884730  0.365551 -0.077145
C -0.858961 -0.710047  0.093110 -0.438866
D  0.022216  0.155334  1.852503  2.558013
E  0.806120 -0.659891  0.458686 -0.179250

In [24]:
df>0

       W      X     Y      Z
A   True  False  True   True
B   True   True  True  False
C  False  False  True  False
D   True   True  True   True
E   True  False  True  False

In [25]:
df[df>0]

          W         X         Y         Z
A  1.474513       NaN  1.780505  1.010527
B  1.379491  0.884730  0.365551       NaN
C       NaN       NaN  0.093110       NaN
D  0.022216  0.155334  1.852503  2.558013
E  0.806120       NaN  0.458686       NaN

In [26]:
new_df = df[df['W']>0]

In [27]:
new_df

          W         X         Y         Z
A  1.474513 -0.300132  1.780505  1.010527
B  1.379491  0.884730  0.365551 -0.077145
D  0.022216  0.155334  1.852503  2.558013
E  0.806120 -0.659891  0.458686 -0.179250

In [29]:
df[df['W']>0]['Y']

A    1.780505
B    0.365551
D    1.852503
E    0.458686
Name: Y, dtype: float64

In [30]:
df[df['W']>0][['Y','X']]

          Y         X
A  1.780505 -0.300132
B  0.365551  0.884730
D  1.852503  0.155334
E  0.458686 -0.659891

For two conditions you can use | and & with parenthesis:

In [48]:
df['W']>0

A    False
B     True
C     True
D     True
E    False
Name: W, dtype: bool

In [49]:
df['Y']<0

A     True
B     True
C     True
D    False
E     True
Name: Y, dtype: bool

In [33]:
(df['W']<0) & (df['Y'] > 0)

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [35]:
df[(df['W']<0) | (df['Y'] > 0)]

          W         X         Y         Z
A  1.474513 -0.300132  1.780505  1.010527
B  1.379491  0.884730  0.365551 -0.077145
C -0.858961 -0.710047  0.093110 -0.438866
D  0.022216  0.155334  1.852503  2.558013
E  0.806120 -0.659891  0.458686 -0.179250

In [37]:
df.set_index('Z')

                  W         X         Y
Z
 1.010527  1.474513 -0.300132  1.780505
-0.077145  1.379491  0.884730  0.365551
-0.438866 -0.858961 -0.710047  0.093110
 2.558013  0.022216  0.155334  1.852503
-0.179250  0.806120 -0.659891  0.458686

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [56]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [57]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A -0.993263  0.196800 -1.136645  0.000366
1     B  1.025984 -0.156598 -0.031579  0.649826
2     C  2.154846 -0.610259 -0.755325 -0.346419
3     D  0.147027 -0.479448  0.558769  1.024810
4     E -0.925874  1.862864 -1.133817  0.610478

In [62]:
newind = 'CA NY CA OR CO'.split()

In [63]:
df['States'] = newind

In [64]:
df

          W         X         Y         Z States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     CA
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CO

In [65]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
CA      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

In [66]:
df

          W         X         Y         Z States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     CA
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CO

In [67]:
df.set_index('States',inplace=True)

In [68]:
df

               W         X         Y         Z
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
CA      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

# Great Job!

<hr><font color="green"><h1>from file: 04-Missing Data</h1></font>

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [1]:
import numpy as np
import pandas as pd

In [10]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3],
                  'D':[np.nan, np.nan, np.nan]})

In [11]:
df

     A    B  C   D
0  1.0  5.0  1 NaN
1  2.0  NaN  2 NaN
2  NaN  NaN  3 NaN

In [4]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [5]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [17]:
df.dropna(thresh=1, axis=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [20]:
df.fillna(value='Anything')

          A         B  C         D
0         1         5  1  Anything
1         2  Anything  2  Anything
2  Anything  Anything  3  Anything

In [25]:
df['A'].fillna(value=df['A'].mean(),inplace=True)

In [26]:
df

     A    B  C   D
0  1.0  5.0  1 NaN
1  2.0  NaN  2 NaN
2  1.5  NaN  3 NaN

# Great Job!

<hr><font color="green"><h1>from file: 05-Groupby</h1></font>

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [1]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [2]:
df = pd.DataFrame(data)

In [3]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [4]:
df.groupby('Company')

You can save this object as a new variable:

In [5]:
by_comp = df.groupby("Company")

And then call aggregate methods off the object:

In [6]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [7]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [8]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [9]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [10]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [11]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

# Great Job!

<hr><font color="green"><h1>from file: 06-Merging, Joining, and Concatenating</h1></font>

# Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating. In this lecture we will discuss these 3 methods with examples.

____

### Example DataFrames

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [3]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [4]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [5]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [6]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [7]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [8]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [15]:
pd.concat([df1.reset_index(),df2.reset_index(),df3.reset_index()],axis=1)

   index   A   B   C   D  index   A   B   C   D  index    A    B    C    D
0      0  A0  B0  C0  D0      4  A4  B4  C4  D4      8   A8   B8   C8   D8
1      1  A1  B1  C1  D1      5  A5  B5  C5  D5      9   A9   B9   C9   D9
2      2  A2  B2  C2  D2      6  A6  B6  C6  D6     10  A10  B10  C10  D10
3      3  A3  B3  C3  D3      7  A7  B7  C7  D7     11  A11  B11  C11  D11

_____
## Example DataFrames

In [20]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K4'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [17]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [21]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K4  C3  D3

___

## Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [23]:
pd.merge(left,right,how='outer',on='key')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2   C2   D2
3  K3   A3   B3  NaN  NaN
4  K4  NaN  NaN   C3   D3

## Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [24]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [25]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [26]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [29]:
left.join(right, how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [30]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Great Job!

<hr><font color="green"><h1>from file: 07-Operations</h1></font>

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [27]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [7]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [8]:
df['col2'].nunique()

3

In [9]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [12]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) | (df['col2']==444)]

In [13]:
newdf

   col1  col2 col3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

### Applying Functions

In [14]:
def times2(x):
    return x*2

In [17]:
times2(df['col1'])

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [18]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [19]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [21]:
df['col3'].sum()

'abcdefghixyz'

** Permanently Removing a Column**

In [22]:
del df['col1']

In [23]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Get column and index names: **

In [24]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [32]:
from numpy.random import randn
df1 = pd.DataFrame(randn(5,4),index=['A','B','C','D','E'],columns='W X Y Z'.split())

In [34]:
df.index

RangeIndex(start=0, stop=4, step=1)

** Sorting and Ordering a DataFrame:**

In [35]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [37]:
df.sort_values(by='col1') #inplace=False by default

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Great Job!

<hr><font color="green"><h1>from file: 08-Data Input and Output</h1></font>

# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

In [4]:
import numpy as np
import pandas as pd

## CSV

### CSV Input

In [10]:
# path = 'C:\Users\Dell\Desktop\KVCH\03-Pandas\munendra1\munendra2'
df = pd.read_csv('C:\\Users\\Dell\\Desktop\\KVCH\\03-Pandas\\munendra1\\munendra2\\example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [11]:
df = pd.read_csv('C:/Users/Dell/Desktop/KVCH/03-Pandas/munendra1/munendra2/example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [14]:
df = pd.read_csv('./munendra1/munendra2/example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### CSV Output

In [15]:
df = df+df

In [16]:
df

    a   b   c   d
0   0   2   4   6
1   8  10  12  14
2  16  18  20  22
3  24  26  28  30

In [17]:
df.to_csv('example.csv',index=False)

## Excel
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

### Excel Input

In [38]:
df = pd.read_excel('Excel_Sample.xlsx',sheet_name=0,  index_col=4)

In [37]:
df['States']

0    CA
1    AB
2    WA
3    SF
Name: States, dtype: object

### Excel Output

In [40]:
df.to_excel('Excel_Sample1.xlsx',sheet_name='Sheet1')

## HTML

You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

Pandas can read table tabs off of html. For example:

### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [41]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [57]:
df[0].iloc[100]

Bank Name                Inter Savings Bank, fsb D/B/A InterBank, fsb
City                                                      Maple Grove
ST                                                                 MN
CERT                                                            31495
Acquiring Institution                             Great Southern Bank
Closing Date                                           April 27, 2012
Name: 100, dtype: object

____

# Great Job!